{
    "category": {
        "title": "Salah & Masjid",
        "icon": "fa-mosque",
        "color": "bg-emerald-600"
    },
    "duas": [
        {
            "title": "After Hearing the Adhan",
            "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ وَبَعْثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ",
            "transliteration": "Allahumma rabba hadhihi-dda‘watit-tammati was-salatil-qaa’imati, ati Muhammadan al-wasilata wal-fadilah, wab‘athhu maqaman mahmoodan alladhi wa‘adtahu",
            "translation": "O Allah, Lord of this perfect call and established prayer, grant Muhammad the intercession and favour, and raise him to the praised position You have promised him.",
            "translation_tamil": "ஓ அல்லாஹ்! இந்த முழுமையான அழைப்புக்கும் நிலையான நமாஜுக்கும் ஆண்டவரே, முகம்மது ﷺக்கு இடம் மற்றும் பெருமையை தருவாயாக. நீ நிர்ப்பந்தித்த பாராட்டப்பட்ட நிலையை அவருக்குத் தருவாயாக.",
            "reference": "Sahih al-Bukhari 614",
            "benefits": "Asking Allah to grant the Prophet ﷺ the highest status and intercession.",
            "when": "Recite after hearing the call to prayer (adhan)."
        },
        {
            "title": "Dua After Wudu",
            "arabic": "أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
            "transliteration": "Ashhadu alla ilaha illa Allah, wa ashhadu anna Muhammadadan abduhu wa rasooluhu",
            "translation": "I bear witness that there is no deity except Allah, and I bear witness that Muhammad is His servant and Messenger.",
            "translation_tamil": "நான் அல்லாவ් தவிர எந்த தெய்வமும் இல்லை என்பதை சாட்சி தருகிறேன்; முகம்மது அவரின் அப்பாவும் தூதரனுமானவர் என்பதைச் சாட்சி தருகிறேன்.",
            "reference": "Sunan An-Nasa'i",
            "benefits": "Recognition of faith and reward for purification.",
            "when": "Recite after completing wudu (ablution)."
        },
        {
            "title": "Entering the Masjid",
            "arabic": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
            "transliteration": "Allahumma iftah li abwaba rahmatika",
            "translation": "O Allah, open for me the doors of Your mercy.",
            "translation_tamil": "ஓ அல்லாஹ்! உங்கள் தயவுக்காரரின் கதவுகளை எனக்குத் திறிக்கவும்.",
            "reference": "Sahih Muslim",
            "benefits": "Seeking Allah’s mercy as you enter His house.",
            "when": "Recite when entering the mosque before stepping inside. Facing qiblah is preferred."
        },
        {
            "title": "Leaving the Masjid",
            "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَأَعُوذُ بِكَ مِنَ الشَّيْطَانِ الرَّجِيمِ",
            "transliteration": "Allahumma inni as’aluka min fadhlik wa a‘udhu bika minash-shaytanir-rajim",
            "translation": "O Allah, I ask You from Your bounty, and I seek refuge with You from the accursed Satan.",
            "translation_tamil": "ஓ அல்லாஹ்! உங்கள் பெருமையிலிருந்து நான் Youயிடம் வேண்டுகிறேன், மற்றும் அதன் அவமானமான சைத்தானிலிருந்து உங்களிடத்தில் சட்சியம் பெறுகிறேன்.",
            "reference": "Sunan Abi Dawud / other hadith collections",
            "benefits": "Seeking Allah’s favor and protection from Shaytan as you leave the mosque.",
            "when": "Recite when exiting the mosque after prayer or visit."
        }
    ]
}
